In [1]:
import pandas as pd

In [2]:
#dataframe
a= [1,3,8]
df= pd.DataFrame(a, columns=["helo"])
df

   helo
0     1
1     3
2     8

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   helo    3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [4]:
a= [["sojib", "cool", "bro"],[1,3,8]]
df= pd.DataFrame(a)
df

       0     1    2
0  sojib  cool  bro
1      1     3    8

In [5]:
a= [["sojib", "cool", "bro"],[1,3,8]]
df= pd.DataFrame(a, columns=["col1","col2", "col2"])
df

    col1  col2 col2
0  sojib  cool  bro
1      1     3    8

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      object
 1   col2    2 non-null      object
 2   col2    2 non-null      object
dtypes: object(3)
memory usage: 180.0+ bytes

In [8]:
a ={"name":["hanif","rony"],
    "age":[12,11],
    "pro":["tea", "chor"]}
df = pd.DataFrame(a)
df

    name  age   pro
0  hanif   12   tea
1   rony   11  chor

In [9]:
a = {"name":["hanif","rony","dipjol"],
    "age":[12,11,30],
    "pro":["tea", "chor","dakait"]}
df = pd.DataFrame(a)
df

     name  age     pro
0   hanif   12     tea
1    rony   11    chor
2  dipjol   30  dakait

In [10]:
df=df.rename({"name":"Name","age":"Age", "pro":"PRO"}, axis =1 )

In [11]:
df

     Name  Age     PRO
0   hanif   12     tea
1    rony   11    chor
2  dipjol   30  dakait

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   PRO     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [14]:
a = {"name":["hanif","rony","dipjol"],
    "age":[100000,20000,30000],
    "pro":["tea", "chor","dakait"]}
df = pd.DataFrame(a)
df

     name     age     pro
0   hanif  100000     tea
1    rony   20000    chor
2  dipjol   30000  dakait

In [15]:
df[["age"]].astype("int32")

      age
0  100000
1   20000
2   30000

In [16]:
df[["age", "pro"]]

      age     pro
0  100000     tea
1   20000    chor
2   30000  dakait

In [17]:
df["age"]>20000

0     True
1    False
2     True
Name: age, dtype: bool

In [18]:
df[df["age"]>30000]

    name     age  pro
0  hanif  100000  tea

In [19]:
df[df["age"]>30000]["pro"]

0    tea
Name: pro, dtype: object

In [20]:
import pandas as pd
a = {"name":["hanif","rony","dipjol"],
    "age":[100000,20000,30000],
    "pro":["tea", "chor","dakait"]}
df = pd.DataFrame(a)
df

     name     age     pro
0   hanif  100000     tea
1    rony   20000    chor
2  dipjol   30000  dakait

In [21]:
a = {"name":["sojib","rony","dipjol"],
    "age":[1000,2000,3000],
    "pro":["new", "pro","came"]}
df1 = pd.DataFrame(a)
df1

     name   age   pro
0   sojib  1000   new
1    rony  2000   pro
2  dipjol  3000  came

In [22]:
new_df = pd.concat([df,df1],axis=1)
new_df

     name     age     pro    name   age   pro
0   hanif  100000     tea   sojib  1000   new
1    rony   20000    chor    rony  2000   pro
2  dipjol   30000  dakait  dipjol  3000  came

In [23]:
new_df1 = pd.concat([df,df1], ignore_index=True)
new_df1

     name     age     pro
0   hanif  100000     tea
1    rony   20000    chor
2  dipjol   30000  dakait
3   sojib    1000     new
4    rony    2000     pro
5  dipjol    3000    came

In [ ]:
import numpy as np
data = np.random.rand(8,4)
for c in range(data.shape[1]):
  nan_valu=np.random.choice(6,4, replace=False)
  data[nan_valu,c]=np.nan
  df=pd.DataFrame(data)

In [27]:
df

          0         1         2         3
0  0.096984       NaN  0.491887       NaN
1       NaN       NaN       NaN  0.305380
2       NaN       NaN       NaN       NaN
3  0.090137       NaN  0.175728  0.069609
4       NaN  0.391087       NaN       NaN
5       NaN  0.397730       NaN       NaN
6  0.393661  0.429058  0.397613  0.457911
7  0.595284  0.761094  0.211261  0.521097

In [28]:
df.columns=["col1", "col2","col3","col4"]
df

       col1      col2      col3      col4
0  0.096984       NaN  0.491887       NaN
1       NaN       NaN       NaN  0.305380
2       NaN       NaN       NaN       NaN
3  0.090137       NaN  0.175728  0.069609
4       NaN  0.391087       NaN       NaN
5       NaN  0.397730       NaN       NaN
6  0.393661  0.429058  0.397613  0.457911
7  0.595284  0.761094  0.211261  0.521097

In [29]:
df1=df.copy()
df2=df.copy()
df3=df.copy()

In [30]:
df.dropna()

       col1      col2      col3      col4
6  0.393661  0.429058  0.397613  0.457911
7  0.595284  0.761094  0.211261  0.521097

In [31]:
df.drop(["col4"], axis=1,inplace=True)

In [32]:
df

       col1      col2      col3
0  0.096984       NaN  0.491887
1       NaN       NaN       NaN
2       NaN       NaN       NaN
3  0.090137       NaN  0.175728
4       NaN  0.391087       NaN
5       NaN  0.397730       NaN
6  0.393661  0.429058  0.397613
7  0.595284  0.761094  0.211261

In [33]:
df2.fillna(1)

       col1      col2      col3      col4
0  0.096984  1.000000  0.491887  1.000000
1  1.000000  1.000000  1.000000  0.305380
2  1.000000  1.000000  1.000000  1.000000
3  0.090137  1.000000  0.175728  0.069609
4  1.000000  0.391087  1.000000  1.000000
5  1.000000  0.397730  1.000000  1.000000
6  0.393661  0.429058  0.397613  0.457911
7  0.595284  0.761094  0.211261  0.521097

In [34]:
df3.describe()

           col1      col2      col3      col4
count  4.000000  4.000000  4.000000  4.000000
mean   0.294016  0.494742  0.319122  0.338499
std    0.245683  0.178338  0.150781  0.200832
min    0.090137  0.391087  0.175728  0.069609
25%    0.095272  0.396070  0.202378  0.246437
50%    0.245322  0.413394  0.304437  0.381645
75%    0.444067  0.512067  0.421182  0.473707
max    0.595284  0.761094  0.491887  0.521097

In [35]:
df3["col1"].mean()

np.float64(0.29401640849906846)

In [36]:
df3["col1"].quantile(.25)

np.float64(0.09527208954970698)

In [37]:
df3["col1"].quantile(.50)

np.float64(0.24532221497572432)

In [38]:
df3["col1"]=df3["col1"].fillna(df3["col1"].quantile(.25))
df3

       col1      col2      col3      col4
0  0.096984       NaN  0.491887       NaN
1  0.095272       NaN       NaN  0.305380
2  0.095272       NaN       NaN       NaN
3  0.090137       NaN  0.175728  0.069609
4  0.095272  0.391087       NaN       NaN
5  0.095272  0.397730       NaN       NaN
6  0.393661  0.429058  0.397613  0.457911
7  0.595284  0.761094  0.211261  0.521097